Documents/ОбъединениеЗаписейСкладскогоЖурнала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ОбъединениеЗаписейСкладскогоЖурнала</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеПродукции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВырабатываемаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НекачественныйГруз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультирующаяЗаписьСкладскогоЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкоропортящаясяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Comment>Истина = Объединение, Ложь   = Присоединение</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПродукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>GUIDСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурнала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокФизическихУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>GUIDСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыМаркировок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Упаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УровниУпаковок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ВерсииЗаписейСкладскогоЖурнала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ВерсииЗаписейСкладскогоЖурнала</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>UUID_Меркурий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусВерсииЗаписиСкладскогоЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыВерсийЗаписейСкладскогоЖурнала</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаписьСкладскогоЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID_Меркурий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыЗаданияДаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СпособыЗаданияДаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезСрокаГодности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неизвестно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОграничен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИнтервал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Продукция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Продукция</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПодвидыПродукции</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.НоменклатураУчетнойСистемы</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID_Меркурий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГОСТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродукцияПолучателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственникТорговойМарки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Упаковки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДМ_КодSAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДМ_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроизводителиПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СобственнаяПродукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ОбъединениеЗаписейСкладскогоЖурнала/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Ответственный") Тогда 
		ДополнительныеСвойства.Свойство("Ответственный", Ответственный);
	Иначе	
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ИнтеграцияВетисAPIСервер.УстановитьСтатусПодготовлен(Ссылка);
	СформироватьДвижения();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ТаблицаПродукция.Очистить();
	СписокФизическихУпаковок.Очистить();
	ЗаписьСкладскогоЖурнала = Справочники.СвойстваЗаписейСкладскогоЖурнала.ПустаяСсылка();
	РезультирующаяЗаписьСкладскогоЖурнала = Справочники.СвойстваЗаписейСкладскогоЖурнала.ПустаяСсылка();
	Количество = 0;
	
	ЕстьПравоОбслуживания = ИнтеграцияВетисAPIСервер.ПроверитьОграниченияПользователя(Организация, Предприятие);
	
	Если НЕ ЕстьПравоОбслуживания Тогда
		Предприятие = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИнтеграцияВетисAPIСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
	ИсключаемыеРеквизиты = Новый Массив;
	Если ТипОперации Тогда
		
		ИсключаемыеРеквизиты.Добавить("ЗаписьСкладскогоЖурнала");
		
		Если ТаблицаПродукция.Количество() < 2 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
								НСтр("ru = 'Для типа операции объединение должно быть указано как минимум 2 записи складского журнала.'"),
								ЭтотОбъект,
								"ТаблицаПродукция",
								,
								Отказ);
		КонецЕсли;
							
	Иначе
		
		ИсключаемыеРеквизиты.Добавить("Продукция");
		ИсключаемыеРеквизиты.Добавить("СтранаПроисхождения");

		Если ТаблицаПродукция.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
								НСтр("ru = 'Не введено ни одной строки в список ""Продукция"".'"),
								ЭтотОбъект,
								"ТаблицаПродукция",
								,
								Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ИсключаемыеРеквизиты);
	
	ПроверитьКорректностьЗаполненияТабличнойЧасти(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьКорректностьЗаполненияТабличнойЧасти(Отказ)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПродукция.НомерСтроки КАК НомерСтроки,
		|	ВЫРАЗИТЬ(ТаблицаПродукция.ЗаписьСкладскогоЖурнала КАК Справочник.СвойстваЗаписейСкладскогоЖурнала) КАК ЗаписьСкладскогоЖурнала,
		|	&ТипОперации КАК ТипОперации
		|ПОМЕСТИТЬ ВТ_ТаблицаПродукция
		|ИЗ
		|	&ТаблицаПродукция КАК ТаблицаПродукция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&СтранаПроисхождения КАК СтранаПроисхождения,
		|	&СкоропортящаясяПродукция КАК СкоропортящаясяПродукция,
		|	&НекачественныйГруз КАК НекачественныйГруз,
		|	&ТипОперации КАК ТипОперации,
		|	ВЫРАЗИТЬ(&ЗаписьСкладскогоЖурнала КАК Справочник.СвойстваЗаписейСкладскогоЖурнала) КАК ЗаписьСкладскогоЖурнала,
		|	&Продукция КАК Продукция
		|ПОМЕСТИТЬ ВТ_ДокументОбъединения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ОбъединениеЗаписейСкладскогоЖурнала.Продукция КАК Справочник.Продукция).Владелец.Владелец КАК ВидПродукции,
		|	ОбъединениеЗаписейСкладскогоЖурнала.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ОбъединениеЗаписейСкладскогоЖурнала.СкоропортящаясяПродукция КАК СкоропортящаясяПродукция,
		|	ОбъединениеЗаписейСкладскогоЖурнала.НекачественныйГруз КАК НекачественныйГруз,
		|	ЗНАЧЕНИЕ(Справочник.СвойстваЗаписейСкладскогоЖурнала.ПустаяСсылка) КАК ЗаписьСкладскогоЖурнала,
		|	ОбъединениеЗаписейСкладскогоЖурнала.ТипОперации КАК ТипОперации,
		|	ЗНАЧЕНИЕ(Перечисление.СпособыЗаданияДаты.ПустаяСсылка) КАК ФорматДатыВыработки,
		|	ЗНАЧЕНИЕ(Перечисление.СпособыЗаданияДаты.ПустаяСсылка) КАК ФорматСрокаГодности,
		|	ЛОЖЬ КАК ЗаписьСкладскогоЖурналаНеИспользуется,
		|	ЗНАЧЕНИЕ(Справочник.СтатусыВерсийЗаписейСкладскогоЖурнала.ПустаяСсылка) КАК СтатусВерсииЗаписиСкладскогоЖурнала
		|ИЗ
		|	ВТ_ДокументОбъединения КАК ОбъединениеЗаписейСкладскогоЖурнала
		|ГДЕ
		|	ОбъединениеЗаписейСкладскогоЖурнала.ТипОперации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ОбъединениеЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала КАК Справочник.СвойстваЗаписейСкладскогоЖурнала).ВидПродукции,
		|	ОбъединениеЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала.СтранаПроисхождения,
		|	ОбъединениеЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала.СкоропортящаясяПродукция,
		|	ОбъединениеЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала.НекачественныйГруз,
		|	ОбъединениеЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала,
		|	ОбъединениеЗаписейСкладскогоЖурнала.ТипОперации,
		|	ОбъединениеЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала.ФорматДатыВыработки,
		|	ОбъединениеЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала.ФорматСрокаГодности,
		|	ОбъединениеЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала.НеИспользуется,
		|	ВерсииЗаписейСкладскогоЖурнала.СтатусВерсииЗаписиСкладскогоЖурнала
		|ИЗ
		|	ВТ_ДокументОбъединения КАК ОбъединениеЗаписейСкладскогоЖурнала
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииЗаписейСкладскогоЖурнала КАК ВерсииЗаписейСкладскогоЖурнала
		|		ПО ОбъединениеЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала = ВерсииЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала
		|ГДЕ
		|	НЕ ОбъединениеЗаписейСкладскогоЖурнала.ТипОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.НомерСтроки КАК НомерСтроки,
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала,
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.ЗаписьСкладскогоЖурнала.НеИспользуется КАК ЗаписьСкладскогоЖурналаНеИспользуется,
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.ЗаписьСкладскогоЖурнала.ВидПродукции КАК ВидПродукции,
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.ЗаписьСкладскогоЖурнала.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.ЗаписьСкладскогоЖурнала.СкоропортящаясяПродукция КАК СкоропортящаясяПродукция,
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.ЗаписьСкладскогоЖурнала.НекачественныйГруз КАК НекачественныйГруз,
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.ЗаписьСкладскогоЖурнала.ФорматДатыВыработки КАК ФорматДатыВыработки,
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.ЗаписьСкладскогоЖурнала.ФорматСрокаГодности КАК ФорматСрокаГодности,
		|	ВерсииЗаписейСкладскогоЖурнала.СтатусВерсииЗаписиСкладскогоЖурнала КАК СтатусВерсииЗаписиСкладскогоЖурнала
		|ИЗ
		|	ВТ_ТаблицаПродукция КАК ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииЗаписейСкладскогоЖурнала КАК ВерсииЗаписейСкладскогоЖурнала
		|		ПО ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.ЗаписьСкладскогоЖурнала = ВерсииЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала
		|ГДЕ
		|	НЕ ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.ТипОперации";
	
	Запрос.УстановитьПараметр("СтранаПроисхождения", СтранаПроисхождения);
	Запрос.УстановитьПараметр("СкоропортящаясяПродукция", СкоропортящаясяПродукция);
	Запрос.УстановитьПараметр("НекачественныйГруз", НекачественныйГруз);
	Запрос.УстановитьПараметр("ТипОперации", ТипОперации);
	Запрос.УстановитьПараметр("ЗаписьСкладскогоЖурнала", ЗаписьСкладскогоЖурнала);
	Запрос.УстановитьПараметр("Продукция", Продукция);
	Запрос.УстановитьПараметр("ТаблицаПродукция", ТаблицаПродукция.Выгрузить(,"НомерСтроки, ЗаписьСкладскогоЖурнала"));
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = РезультатПакет[2].Выбрать();
	ВыборкаТЧ    = РезультатПакет[3].Выбрать();
	ВыборкаШапка.Следующий();
	Если Не ВыборкаШапка.ТипОперации Тогда
		Если ЗначениеЗаполнено(ВыборкаШапка.ЗаписьСкладскогоЖурнала) Тогда
			
			ИнтеграцияВетисAPIСервер.ПроверитьКорректностьСвойствЗаписиСкладскогоЖурнала(ЭтотОбъект, ВыборкаШапка,,, Отказ);
			
			Если ВыборкаШапка.ФорматДатыВыработки = Перечисления.СпособыЗаданияДаты.Строка
				ИЛИ ВыборкаШапка.ФорматСрокаГодности = Перечисления.СпособыЗаданияДаты.Строка Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						НСтр("ru = '""Дата выработки продукции""/""Срок годности продукции"" указаны в формате ""Строка"". Запрещено использовать формат даты ""Строка"".'"),
						Ссылка,
						"ЗаписьСкладскогоЖурнала"
						,
						,
						Отказ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	ТекстОшибки = НСтр("ru='В строке %1 табличной части Продукция не верно указана запись складского журнала. %2'"); 
	Пока ВыборкаТЧ.Следующий() Цикл
		
		ИнтеграцияВетисAPIСервер.ПроверитьКорректностьСвойствЗаписиСкладскогоЖурнала(ЭтотОбъект, ВыборкаТЧ, "ТаблицаПродукция", "Продукция", Отказ);
		
		Если ВыборкаТЧ.ВидПродукции <> ВыборкаШапка.ВидПродукции Тогда
			ТекстОписанияОшибки = "Вид продукции должен совпадать у объединяемых записей складского журнала.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
								СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ВыборкаТЧ.НомерСтроки, ТекстОписанияОшибки),
								Ссылка,
								ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаПродукция", ВыборкаТЧ.НомерСтроки, "ЗаписьСкладскогоЖурнала")
								,
								,
								Отказ);
		КонецЕсли;
							
		Если ВыборкаТЧ.СтранаПроисхождения <> ВыборкаШапка.СтранаПроисхождения Тогда
			ТекстОписанияОшибки = "Страна происхождения продукции должна совпадать для объединяемых записей складского журнала.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
								СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ВыборкаТЧ.НомерСтроки, ТекстОписанияОшибки),
								Ссылка,
								ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаПродукция", ВыборкаТЧ.НомерСтроки, "ЗаписьСкладскогоЖурнала")
								,
								,
								Отказ);
		КонецЕсли;
		
		Если ВыборкаТЧ.СкоропортящаясяПродукция <> ВыборкаШапка.СкоропортящаясяПродукция Тогда
			ТекстОписанияОшибки = "Пометка скоропортящейся продукции должна совпадать для объединяемых записей складского журнала.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
								СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ВыборкаТЧ.НомерСтроки, ТекстОписанияОшибки),
								Ссылка,
								ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаПродукция", ВыборкаТЧ.НомерСтроки, "ЗаписьСкладскогоЖурнала")
								,
								,
								Отказ);
		КонецЕсли;
		
		
		Если ВыборкаТЧ.НекачественныйГруз <> ВыборкаШапка.НекачественныйГруз Тогда
			ТекстОписанияОшибки = "Пометка некачественного груза должна совпадать для объединяемых записей складского журнала.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
								СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ВыборкаТЧ.НомерСтроки, ТекстОписанияОшибки),
								Ссылка,
								ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаПродукция", ВыборкаТЧ.НомерСтроки, "ЗаписьСкладскогоЖурнала")
								,
								,
								Отказ);
		КонецЕсли;
		
		Если ВыборкаТЧ.ФорматДатыВыработки = Перечисления.СпособыЗаданияДаты.Строка
				ИЛИ ВыборкаТЧ.ФорматСрокаГодности = Перечисления.СпособыЗаданияДаты.Строка Тогда
					ТекстОписанияОшибки = """Дата выработки продукции""/""Срок годности продукции"" указаны в формате ""Строка"". Запрещено использовать формат даты ""Строка"".";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ВыборкаТЧ.НомерСтроки, ТекстОписанияОшибки),
						Ссылка,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаПродукция", ВыборкаТЧ.НомерСтроки, "ЗаписьСкладскогоЖурнала")
						,
						,
						Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвижения()
	
	//Движения.ДвижениеПродукции.Записывать = Истина;
	//Движения.ДвижениеПродукции.Очистить();
	//Движения.ДвижениеПродукции.Записать();
	//
	//ТаблицаДвижений = Документы.ОбъединениеЗаписейСкладскогоЖурнала.ПодготовитьТаблицуДвижений(Ссылка);
	//
	//Движения.ДвижениеПродукции.Загрузить(ТаблицаДвижений);
	//Движения.Записать();
	
КонецПроцедуры

Процедура ПодготовитьДанныеДокумента(Запрос)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОбъединениеЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала
		|ПОМЕСТИТЬ ВТ_ЗаписиДляСписания
		|ИЗ
		|	Документ.ОбъединениеЗаписейСкладскогоЖурнала КАК ОбъединениеЗаписейСкладскогоЖурнала
		|ГДЕ
		|	ОбъединениеЗаписейСкладскогоЖурнала.Ссылка = &Ссылка
		|	И НЕ ОбъединениеЗаписейСкладскогоЖурнала.ТипОперации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.ЗаписьСкладскогоЖурнала
		|ИЗ
		|	Документ.ОбъединениеЗаписейСкладскогоЖурнала.ТаблицаПродукция КАК ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция
		|ГДЕ
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъединениеЗаписейСкладскогоЖурнала.Организация КАК Организация,
		|	ОбъединениеЗаписейСкладскогоЖурнала.Предприятие КАК Предприятие,
		|	ОбъединениеЗаписейСкладскогоЖурнала.РезультирующаяЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала,
		|	ОбъединениеЗаписейСкладскогоЖурнала.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ЗаписьДляПрихода
		|ИЗ
		|	Документ.ОбъединениеЗаписейСкладскогоЖурнала КАК ОбъединениеЗаписейСкладскогоЖурнала
		|ГДЕ
		|	ОбъединениеЗаписейСкладскогоЖурнала.Ссылка = &Ссылка";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Выполнить();
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
